build/resources/main/wsdl/PCIP_ESB.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://xlogics.eu/blackbox" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="kn-Pcip-V1-VS" targetNamespace="http://xlogics.eu/blackbox">
   <wsdl:documentation>Contract Logistics Impl. Based on the naming convention</wsdl:documentation>
   <wsdl:types>
      <xsd:schema targetNamespace="http://xlogics.eu/blackbox/Imports">
         <xsd:import namespace="http://xlogics.eu/blackbox" schemaLocation="BlackBox.svc.xsd_xsd1" />
         <xsd:import namespace="http://schemas.microsoft.com/2003/10/Serialization/" schemaLocation="BlackBox.svc.xsd_xsd0" />
         <xsd:import namespace="http://knesb.int.kn/xsd/esb/audit/v01" schemaLocation="KNESB_Audit_v1_1.xsd" />
      </xsd:schema>
   </wsdl:types>
   <wsdl:message name="PrintParcelRequest_Headers">
      <wsdl:part element="tns:Authentication" name="Authentication" />
   </wsdl:message>
   <wsdl:message name="DeleteParcelResponse">
      <wsdl:part element="tns:DeleteParcelResponse" name="parameters" />
   </wsdl:message>
   <wsdl:message name="BlackBoxContract_CloseShipments_FaultFault_FaultMessage">
      <wsdl:part element="tns:Fault" name="detail" />
   </wsdl:message>
   <wsdl:message name="CloseShipmentsRequest">
      <wsdl:part element="tns:CloseShipmentsRequest" name="parameters" />
   </wsdl:message>
   <wsdl:message name="DeleteParcelRequest">
      <wsdl:part element="tns:DeleteParcelRequest" name="parameters" />
   </wsdl:message>
   <wsdl:message name="DeleteParcelRequest_Headers">
      <wsdl:part element="tns:Authentication" name="Authentication" />
   </wsdl:message>
   <wsdl:message name="BlackBoxContract_DeleteParcel_FaultFault_FaultMessage">
      <wsdl:part element="tns:Fault" name="detail" />
   </wsdl:message>
   <wsdl:message name="PrintParcelResponse">
      <wsdl:part element="tns:PrintParcelResponse" name="parameters" />
   </wsdl:message>
   <wsdl:message name="CloseShipmentsResponse">
      <wsdl:part element="tns:CloseShipmentsResponse" name="parameters" />
   </wsdl:message>
   <wsdl:message name="BlackBoxContract_PrintParcel_FaultFault_FaultMessage">
      <wsdl:part element="tns:Fault" name="detail" />
   </wsdl:message>
   <wsdl:message name="CloseShipmentsRequest_Headers">
      <wsdl:part element="tns:Authentication" name="Authentication" />
   </wsdl:message>
   <wsdl:message name="PrintParcelRequest">
      <wsdl:part element="tns:PrintParcelRequest" name="parameters" />
   </wsdl:message>
   <wsdl:portType name="BlackBoxContract">
      <wsdl:operation name="PrintParcel">
         <wsdl:input message="tns:PrintParcelRequest" name="PrintParcelRequest" wsaw:Action="http://xlogics.eu/blackbox/BlackBoxContract/PrintParcel" />
         <wsdl:output message="tns:PrintParcelResponse" name="PrintParcelResponse" wsaw:Action="http://xlogics.eu/blackbox/BlackBoxContract/PrintParcel" />
         <wsdl:fault message="tns:BlackBoxContract_PrintParcel_FaultFault_FaultMessage" name="FaultFault" wsaw:Action="http://xlogics.eu/blackbox/BlackBoxContract/PrintParcelFaultFault" />
      </wsdl:operation>
      <wsdl:operation name="DeleteParcel">
         <wsdl:input message="tns:DeleteParcelRequest" name="DeleteParcelRequest" wsaw:Action="http://xlogics.eu/blackbox/BlackBoxContract/DeleteParcel" />
         <wsdl:output message="tns:DeleteParcelResponse" name="DeleteParcelResponse" wsaw:Action="http://xlogics.eu/blackbox/BlackBoxContract/DeleteParcel" />
         <wsdl:fault message="tns:BlackBoxContract_DeleteParcel_FaultFault_FaultMessage" name="FaultFault" wsaw:Action="http://xlogics.eu/blackbox/BlackBoxContract/DeleteParcelFaultFault" />
      </wsdl:operation>
      <wsdl:operation name="CloseShipments">
         <wsdl:input message="tns:CloseShipmentsRequest" name="CloseShipmentsRequest" wsaw:Action="http://xlogics.eu/blackbox/BlackBoxContract/CloseShipments" />
         <wsdl:output message="tns:CloseShipmentsResponse" name="CloseShipmentsResponse" wsaw:Action="http://xlogics.eu/blackbox/BlackBoxContract/CloseShipments" />
         <wsdl:fault message="tns:BlackBoxContract_CloseShipments_FaultFault_FaultMessage" name="FaultFault" wsaw:Action="http://xlogics.eu/blackbox/BlackBoxContract/CloseShipmentsFaultFault" />
      </wsdl:operation>
   </wsdl:portType>
   <wsdl:binding name="BlackBox" type="tns:BlackBoxContract">
      <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
      <wsdl:operation name="PrintParcel">
         <soap:operation soapAction="http://xlogics.eu/blackbox/BlackBoxContract/PrintParcel" style="document" />
         <wsdl:input name="PrintParcelRequest">
            <soap:header message="tns:PrintParcelRequest_Headers" part="Authentication" use="literal" />
            <soap:body use="literal" />
         </wsdl:input>
         <wsdl:output name="PrintParcelResponse">
            <soap:body use="literal" />
         </wsdl:output>
         <wsdl:fault name="FaultFault">
            <soap:fault name="FaultFault" use="literal" />
         </wsdl:fault>
      </wsdl:operation>
      <wsdl:operation name="DeleteParcel">
         <soap:operation soapAction="http://xlogics.eu/blackbox/BlackBoxContract/DeleteParcel" style="document" />
         <wsdl:input name="DeleteParcelRequest">
            <soap:header message="tns:DeleteParcelRequest_Headers" part="Authentication" use="literal" />
            <soap:body use="literal" />
         </wsdl:input>
         <wsdl:output name="DeleteParcelResponse">
            <soap:body use="literal" />
         </wsdl:output>
         <wsdl:fault name="FaultFault">
            <soap:fault name="FaultFault" use="literal" />
         </wsdl:fault>
      </wsdl:operation>
      <wsdl:operation name="CloseShipments">
         <soap:operation soapAction="http://xlogics.eu/blackbox/BlackBoxContract/CloseShipments" style="document" />
         <wsdl:input name="CloseShipmentsRequest">
            <soap:header message="tns:CloseShipmentsRequest_Headers" part="Authentication" use="literal" />
            <soap:body use="literal" />
         </wsdl:input>
         <wsdl:output name="CloseShipmentsResponse">
            <soap:body use="literal" />
         </wsdl:output>
         <wsdl:fault name="FaultFault">
            <soap:fault name="FaultFault" use="literal" />
         </wsdl:fault>
      </wsdl:operation>
   </wsdl:binding>
   <wsdl:service name="kn-Pcip-V1-VS">
      <wsdl:port binding="tns:BlackBox" name="BlackBox_soaphttp_KNMED_TEST2">
         <soap:address location="http://esb-test.int.kn:8888/ws/kn-Pcip-V1-VS" />
      </wsdl:port>
      <wsdl:port binding="tns:BlackBox" name="BlackBox_soaphttp_KNMED_TEST">
         <soap:address location="http://esb-test.int.kn:8888/ws/kn-Pcip-V1-VS" />
      </wsdl:port>
   </wsdl:service>
</wsdl:definitions>